#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“* ”组成的X形图案。
//输入描述：
//多组输入，一个整数（2~20），表示输出的行数，也表示组成“X”的反斜线和正斜线的长度。
//输出描述：
//针对每行输入，输出用“ * ”组成的X形图案。

//int main()
//{
//	int k = 0;
//	int i = 0;
//	int j = 0;
//	while ((scanf("%d", &k)) != EOF)
//	{
//		for (i = 0; i < k; i++)
//		{
//			for (j = 0; j < k; j++)
//			{
//				if (i == j || i == k - 1 - j)
//				{
//					printf("*");
//				}
//				else
//				{
//					printf(" ");
//				}
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}
//----------------------------------------------------------------------------------------------------------------------

//公务员面试现场打分。有7位考官，从键盘输入若干组成绩，每组7个分数（百分制），
//去掉一个最高分和一个最低分，输出每组的平均成绩。
//输入描述：
//一行，输入7个整数（0~100），代表7个成绩，用空格分隔。
//输出描述：
//一行，输出去掉最高分和最低分的平均成绩，小数点后保留2位，每行输出后换行。

//int main()
//{
//	int score[7] = { 0 };
//	int max = 0;
//	int min = 100;
//	float avg = 0.0;
//	int sum = 0;
//	int i = 0;
//	for (i = 0; i < 7; i++)
//	{
//		scanf("%d", &score[i]);
//		sum = sum + score[i];
//		if (score[i] > max)
//		{
//			max = score[i];
//		}
//		if (score[i] < min)
//		{
//			min = score[i];
//		}
//	}
//	avg = (sum - max - min) / 5.0;
//	printf("%.2f", avg);
//	return 0;
//}
//--------------------------------------------------------------------------------------------------------------------

//有一个有序数字序列，从小到大排序，将一个新输入的数插入到序列中，保证插入新数后，序列仍然是升序。
//输入描述：
//第一行输入一个整数(0≤N≤50)。
//第二行输入N个升序排列的整数，输入用空格分隔的N个整数。
//第三行输入想要进行插入的一个整数。
//输出描述：
//输出为一行，N + 1个有序排列的整数。
//void sort(int* str, int len)
//{
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < len - 1; i++)
//	{
//		for (j = i + 1; j < len; j++)
//		{
//			if (str[i] > str[j])
//			{
//				int tmp = str[i];
//				str[i] = str[j];
//				str[j] = tmp;
//			}
//		}
//	}
//}
//int main()
//{
//	int N = 0;
//	int arr[51] = { 0 };
//	int i = 0;
//	int num = 0;
//	scanf("%d", &N);
//	for (i = 0; i < N; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	scanf("%d", &num);
//	arr[N] = num;
//	sort(arr, N + 1);
//	for (i = 0; i < N+1 ; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	
//	return 0;
//}
//--------------------------------------------------------------------------------------------------------------------

//KiKi想获得某年某月有多少天，请帮他编程实现。输入年份和月份，计算这一年这个月有多少天。
//输入描述：
//多组输入，一行有两个整数，分别表示年份和月份，用空格分隔。
//输出描述：
//针对每组输入，输出为一行，一个整数，表示这一年这个月有多少天。

int main()
{
	int year = 0;
	int month = 0;
	while ((scanf("%d%d", &year, &month)) != EOF)
	{
		if ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0))
		{
			if (month == 2)
			{
				printf("29\n");
				continue;
			}
		}
		if (month == 2)
		{
			printf("28\n");
		}
		else if (month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 12)
		{
			printf("31\n");
		}
		else
		{
			printf("30\n");
		}

	}
	return 0;
}


